In [1]:
import pandas as pd
import numpy as np

In [51]:
df = pd.read_csv(r"C:\Users\Croma Campus\Downloads\Churn_Modelling.csv")

In [52]:
df.shape

(10000, 14)

In [53]:
df.head(4)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0

In [54]:
df.Geography.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [55]:
df.Exited

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [56]:
df.groupby('Gender').agg({'Exited':'count'})

        Exited
Gender
Female    4543
Male      5457

In [57]:
df.groupby('Gender').agg({'Exited':'sum'})

        Exited
Gender
Female    1139
Male       898

In [58]:
df.groupby('Geography').agg({'Exited':'count'})

           Exited
Geography
France       5014
Germany      2509
Spain        2477

In [59]:
df.groupby('Geography').agg({'Exited':'sum'})

           Exited
Geography
France        810
Germany       814
Spain         413

In [60]:
 df.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [61]:
df = df.drop(columns=['RowNumber', 'CustomerId', 'Surname'])

In [62]:
df.shape

(10000, 11)

In [14]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [29]:
# LabelEncoder
def labelEncoder(val):
    li = list(df[col].unique())
    return li.index(val)

In [30]:
global col
for col in df.select_dtypes(include='object').columns:
    df[col] = df[col].map(labelEncoder)

In [31]:
df.shape

(10000, 11)

In [32]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,608,1,0,41,1,83807.86,1,0,1,112542.58,0
2,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,850,1,0,43,2,125510.82,1,1,1,79084.10,0

In [33]:
df.Gender.unique()

array([0, 1])

In [34]:
df.Geography.unique()

array([0, 1, 2])

In [35]:
df.head(3)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,608,1,0,41,1,83807.86,1,0,1,112542.58,0
2,502,0,0,42,8,159660.80,3,1,0,113931.57,1

In [36]:
X = df.drop(columns=['Exited'])

In [37]:
X.head(3)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,1,0,41,1,83807.86,1,0,1,112542.58
2,502,0,0,42,8,159660.80,3,1,0,113931.57

In [38]:
y = df['Exited']

In [39]:
y[:3]

0    1
1    0
2    1
Name: Exited, dtype: int64

In [40]:
X.head(2)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,1,0,41,1,83807.86,1,0,1,112542.58

In [41]:
X.columns

Index(['CreditScore', 'Geography', 'Gender', 'Age', 'Tenure', 'Balance',
       'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary'],
      dtype='object')

In [42]:
scale_list = ['CreditScore','Age','Balance','EstimatedSalary']

In [63]:
# Normalization
def normalization(val):
    return (val - X[col].min())/(X[col].max()-X[col].min())

In [65]:
global col
for col in scale_list:
    X[col] = X[col].map(normalization)

In [66]:
X.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,0.538,0,0,0.324324,2,0.000000,1,1,1,0.506735
1,0.516,1,0,0.310811,1,0.334031,1,0,1,0.562709
2,0.304,0,0,0.324324,8,0.636357,3,1,0,0.569654
3,0.698,0,0,0.283784,1,0.000000,2,0,0,0.469120
4,1.000,1,0,0.337838,2,0.500246,1,1,1,0.395400

In [67]:
for col in scale_list:
    print(col,'\tMIN :',X[col].min(),'\tMAX :',X[col].max())

CreditScore 	MIN : 0.0 	MAX : 1.0
Age 	MIN : 0.0 	MAX : 1.0
Balance 	MIN : 0.0 	MAX : 1.0
EstimatedSalary 	MIN : 0.0 	MAX : 1.0